# GetAllViewports Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSheet..::..GetAllViewports Method
ViewSheet Class See Also
---
Returns the ElementIds of Viewports on this sheet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ICollection<ElementId> GetAllViewports()
```

Visual Basic
---
```text
Public Function GetAllViewports As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetAllViewports()
```

# ### Return Value
The Viewports on this sheet.
# Remarks
Schedules on the sheet are not returned by this method. Use ScheduleSheetInstance.OwnerViewId to find the sheet on which a schedule is placed.
# See Also
ViewSheet Class
Autodesk.Revit.DB Namespace